---
kind: method
id: M:Autodesk.Revit.DB.TessellatedShapeBuilder.GetBuildResult
source: html/136e8763-4156-4ffe-0fcc-45af9dbb6c14.htm
---
# Autodesk.Revit.DB.TessellatedShapeBuilder.GetBuildResult Method

Get the built geometry, build status and other data stored in TessellatedShapeBuilderResult. Clears the stored data.

## Syntax (C#)
```csharp
public TessellatedShapeBuilderResult GetBuildResult()
```